#列表  在python中叫做列表  也就是在JS中的 array  数组

lists = [1,2,3,4,5,6,7,8,9,10]
#part1
# 和字符串一样  列表  也拥有切片功能

print(lists[:])   #[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(lists[2:])  #[3, 4, 5, 6, 7, 8, 9, 10]
print(lists[:2])  #[1, 2]
print(lists[-2:]) #[9, 10]
print(lists[:-3]) #[1, 2, 3, 4, 5, 6, 7]
#part2
# 拷贝的问题

  # part2-1
a = [1,2,3]
b = a
a[0] =11
print(a,b)  # a = [11,2,3]  b = [11,2,3]
  # part 2-2
c = [4,5,6]
d = c[:]
c[2] = 222
print(c,d)  #c = [4,5,222]  d = [4,5,6]

# 列表拼接

e = ['a','b','c']
f = [1,2,3,2]
print(e + f)   #  ['a', 'b', 'c', 1, 2, 3, 2]

# 向列表里面末尾push 数据
e.append('kobe')
print(e)    #  ['a', 'b', 'c', 'kobe']

# 替换
g = [1,2,3,4,5,6]
g[2:5] = ["C","D","E"]
print(g)    # [1, 2, 'C', 'D', 'E', 6]
g[2:5] = []
print(g)    #[1, 2, 6]

g[:] = [] 
print(g)    #[]  清空列表哈哈哈

# 内置函数 len()

h = [1,2,3,4,5,6,7,8]
print(len(h))   # 8  得出列表的length

# 嵌套列表

k = [1,2,3,4,5]
l =['a','b','c','d']
p = [k,l]
print(p[0],p[1])  #[1, 2, 3, 4, 5] ['a', 'b', 'c', 'd']

print(p[0][3])  # 4
print(p[1][3])  # d
print(p[0][-3])  # 3
print(p[1][-2])  # c



#  列表这一块按照文档也过了一遍  不得不说 得劲儿 哈哈哈




